{
  "author_changes": [
    {
      "post_id": "4cfded1a-da83-3f1b-82d3-1bdb273e0752",
      "new_author": "Joel Swenson",
      "new_text": "Hi all, \nIts hard to believe that its been a week since my last post. For roughly a week from the date of the NK cell infusion Ada had been feeling very, very crummy. She needed to go on oxygen once and was generally lethargic, cranky, achy, and not feeling well. Thankfully Tami's parents were there for part of that time span to help Ada and Tami and to give Tami a bit of a reprieve. I came down Tuesday to switch with Ada and Tami had succeeded in making Ada feel better. Since I've arrived she has been happy with more energy but still has joint pain and general discomfort occasionally. As I mentioned in my last post, Ada's cancer had been doubling every day prior to the NK cell infusion, the infusion killed off roughly half of the cancer in her peripheral blood (Oliver teared up and was very happy/proud of his donation when Tami told him this) and since then the amount of cancer in her peripheral blood is still holding relatively constant (the cancer growth appears to be roughly equal to cancer destruction). We are hoping that the NK cells \"expand\" (i.e. multiply) and start to \"break through\" the cancer but are worried about the cancer \"breaking through\" the NK cell-mediated destruction. Every morning we wake up and wait for her lab results hoping that they trend in the right direction.\nIn the meantime we do our best to enjoy the times when she if feeling well enough to play. Ada spends her days doing occupational therapy (i.e. playing games to improve/maintain fine motor coordination/strength), physical therapy (i.e. playing games to improve/maintain gross motor coordination/strength), school (working on her letters, numbers, counting, logic, memory, etc...school is probably her favorite!), playing with child life (i.e. messy things that make Ada happy), going for bike rides in the garden, bringing her babies to the garden, finding gnomes in the garden, racing her racecar around the room, playing doctor on me or her stuffies pillaging medical supplies from unsuspecting nurses, looking out the window at traffic (lots of ambulances and school buses), resting in be watching her tablet or playing games on it, etc. My parents arrived today for a long weekend visit and Ada and I were both very happy to see them!\nAs always, thanks for everyone's support!\n-Joel\nShow less"
    },
    {
      "post_id": "ee14ec89-98b8-3eec-a39d-c69e6bdc4b2b",
      "new_author": "Joel Swenson"
    },
    {
      "post_id": "e93c44e7-c956-31e4-a3dc-cd44e694c9a6",
      "new_author": "Tami Swenson",
      "new_text": "Ada is already on Day 4 of treatment! That means just 1 more day of iv chemo (and at least 24 more days of the experimental drug). That also means that we are being discharged tomorrow after her last iv chemo. It turns out that St. Jude likes to keep kids outpatient as much as possible to maintain some 'normalcy'...well at least as much as possible given the situation. So we will first be housed at the Tri Delta house which is a 5 minute walk from the hospital. It is basically hotel-style housing. And then we will eventually move to the Ronald McDonald House which is off campus, but is a short shuttle ride away. It seems more appealing because they have their own cafeteria and a place to cook! While we would LOVE to go back home to Wisconsin once we are discharged, we have to stick close by since Ada's cell counts will drop due to the chemo and she is going to be constantly monitored for side effects, etc.\n\nSo far Ada has handled the treatment as well as can be expected. What has helped her immensely is her bike! We were shocked to find out that St. Jude did not have a tricycle so before I headed down, I frantically searched for a suitable bike. Somehow I managed to find nearly the same tricycle that she had at the UW hospital on facebook marketplace! It was new, it was cheap, and the guy gave me 2 for the price of 1!!! So I loaded the 70 lb bike up and drove her down to Memphis (thanks to my dad, the drive down was pretty easy and only took ~9 hours). Ada did a happy dance when we arrived. I like to think it was because I just got there, but it was probably more likely because she saw the bike. She immediately hopped on and rode around to show off her new bike (bedazzled with lights!). \n\nWe've continued to spend our time here biking around (and we've learned to attach a leash to the bike to slow Ada down), exploring all areas of the hospital, meeting the adorable volunteer pups, hanging out in the amazing & delicious cafeteria, admiring the artwork on the walls, and meeting all the staff (we even met physician's assistant Hailey who is a cancer survivor AND astronaut!). Our plans are to be here for at least another 4 weeks. After the 28 days of treatment Ada will have a bone marrow biopsy to see if she has any remaining cancer. If not, then we are moving onto a bone marrow transplant (very likely back in Madison). If there still is cancer... we will have to see if its worth doing more cycles of this treatment or switching to yet another treatment regimen. What has been encouraging so far is blasts have not been seen in her peripheral blood the last two days. While that doesn't necessarily mean the cancer is gone, it is going in the right direction!\n~Tami\nShow less"
    },
    {
      "post_id": "7febce8c-a285-3de0-931b-015ca09e1c32",
      "new_author": "Tami Swenson"
    }
  ]
}